<a href="https://colab.research.google.com/github/manthra16695/Code-360/blob/main/House_Rent_Prediction.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Import Dataset using Pandas

In [27]:
import pandas as pd
data=pd.read_csv('/content/sample_data/rental_data _reg.csv')

Data Cleaning

In [28]:
##Removing variables which has no significance in our model
data=data.drop(labels=['Unnamed: 0','link','result-hood','title'],axis=1)
data.head()

    br          region  result-price    sqft       type
0  3.0  tampa bay area       $1,695      NaN  apartment
1  2.0  tampa bay area       $1,390   1182.0  apartment
2  2.0  tampa bay area  $14,901,795   1101.0  apartment
3  2.0  tampa bay area       $1,285   1025.0  apartment
4  2.0  tampa bay area       $1,379   1028.0  apartment

In [29]:
data.dtypes
data.isnull().sum()## There are 3549 NA values in sqft column and 417 NA values in Bedrooms column

br               417
region             0
result-price       0
sqft            3549
type               0
dtype: int64

In [30]:
##Dropping records with atleast one of thier columns with NA value
data=data.dropna(how='any')
data.count()

br              11268
region          11268
result-price    11268
sqft            11268
type            11268
dtype: int64

In [31]:
##Converting the variable data types into relevant ones
data['br']=data['br'].astype({"br":object})
data.dtypes

br               object
region           object
result-price     object
sqft            float64
type             object
dtype: object

In [32]:
##Converting price into int by converting $ symbol data as regular expression
data['result-price']=data['result-price'].str.replace('[\$,]','',regex=True).astype('int')

Exploratory Data Analysis

In [ ]:
import matplotlib.pyplot as plt
import seaborn as sns

# numericaldata=data[['result-price','sqft']]
# plt.plot(data['sqft'],data['result-price'])
# data['sqft']
# data['result-price']
# sq=int(data['sqft'])
# sns.regplot(sq,data['result-price'])
sns.pairplot(data=data,vars=['sqft','result-price'])

In [ ]:
data['result-price']